// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <windows.h>
#include <iostream>


int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int query;
	std::cout << "Hello world!";
	std::cout << "blabla";
	std::cout << "grechka-buckwheat=313kKalloriy na 100 gramm ()";
	std::cout << "rice=358 kKalloriy na 100 gramm ()";
	std::cin >> query;
	std::cout << query;
	std::cout << "Василий Семенович Лановой - Офицер";
	std::cout << "Возникла проблема - зачем американцы лезут в верхние слои атмосферы  чтобы создать монолитную кремниевую пластину";
	std::cout << "гранат Fe	5.6 % ";
	std::cout << "yellow - жёлтый";
	std::cout << "Ringo Starr - What’s My Name";
	std::cout << "blog, от web log — интернет-журнал событий";
	std::cout << "желЕзо - 56";
	std::cout << "Двенадцатигранная снежинка это уравновешенная система в слоях нулевого поля";
	std::cout << "курск - танки стояли";
	std::cout << "Peter Falko -Columbo - косые глаза";
	std::cout << "японцев на остров сослали ещё б они не присоединились к Гитлеру";
	std::cout << "алгоритм змеи - змею нужно при уходе от преследования под воду подышать от удара медведя уйти или регламентировать высоту прыжка для вдоха и точку выхода рассматривая при этом атаку в существенно слабое место лапастого медведя ногастого уходителя с поля боя для выставления автомата-охранника";
	std::cout << "хрень нужна";
	std::cout << "пули-gekb";
	std::cout << "гавно-гавно shit-гавно";
	std::cout << "кошка перед атакой разминает челюсти резкими прерывистыми напряжениями челюстных мышц";
	std::cout << "думай не думай сто рублей не деньги";
	std::cout << "не слишком то и хотелось";
	std::cout << "канал'только плохие новости'";
	std::cout << "19.10.2019 8:02 cyborg";
	std::cout << "20.10.2019 17:09 хреновая соль вообще хреновая вешь это";
	std::cout << "21.10.2019 12:54 найти кого то это проблема";
	std::cout << "21.10.2019 23:23 Винсент Вега - самый неудачный киллер в истории";
	std::cout << "22.10.2019 9:28 кофе купить 30.10.2019";
	std::cout << "23.10.2019 7:55 эксперимент выперераспределение прамирацетама в средах вода - жареное подсолнечное масло";
	std::cout << "24.10.2019 4:47 мама у меня забрала и отдала шорты чёрные";
	std::cout << "25.10.2019 6:53 изучаю английский язык фильмами и текстами в замедленном режиме (надо сделать замедленный текст Бьярне Страуструпа)";
	std::cout << "26.10.2019 5:46 пизда с ушами";
	std::cout << "27.10.2019 0:59 учусь на столяра";
	std::cout << "28.10.2019 3:27 левша опасен";
	std::cout << "29.10.2019 19:12 нужно что-то ещё попьяняющее в цветность растительное просто край";
	std::cout << "30.10.2019 21:21 Nike AirMax или Nike Lumenaric";
	std::cout << "31.10.2019 6:16 соковыжималка нужна";
	std::cout << "01.11.2019 6:49 гавно";
	std::cout << "02.11.2019 11:56 ищу спецификации своего компьютера в глобальной всемирной паутине с общедоступных источников и при помощи инструментов наглого доступа тоже";
	std::cout << "03.11.2019 20:42 нафига";
	std::cout << "04.11.2019 2:28 анаша до чего ж ты хороша";
	std::cout << "05.11.2019 0:11 нарисовать куб из подноготной";
	std::cout << "06.11.2019 7:47 заброшенные шахты";
	std::cout << "07.11.2019 7:39 ползают и ползают";
	std::cout << "08.11.2019 6:40 соль калия с хлором заходит хорошо";
	std::cout << "09.11.2019 6:33 нетактичная песня на fruity loops";
	std::cout << "10.11.2019 9:54 ничего нет старого доброго никотина";
	std::cout << "11.11.2019 9:51 мускат гнавно без over дохрена энергии";
	std::cout << "12.11.2019 7:01 он этот там на экране охуел так его раз та так";
	std::cout << "13.11.2019 4:19 дурак на кухне";
	std::cout << "14.11.2019 6:29 молочай Палласа может уже нет";
	std::cout << "15.11.2019 7:54 бабочка охуела слишком много превращений и жива до сих пор падла - как?";
	std::cout << "16.11.2019 14:37 колени! только чистые продукты и присядания с отягощениями";
	std::cout << "16.11.2019 22:19 чуть не забыл про режим из-за малого количества сна по времени";
	std::cout << "17.11.2019 6:34 коты - надо покормить бы - чёрные";
	std::cout << "18.11.2019 0:44 коленки мне нужны";
	std::cout << "19.11.2019 2:36 надо найти спецификации на своего коня";
	std::cout << "19.11.2019 7:30 надо купить димедрола";
	std::cout << "20.11.2019 20:00 надо купить димедрола!!!";
	std::cout << "21.11.2019 9:52 никотин хороший! восстанавливает нужные связи после пьянки с участием 2-х разнообразных пизд";
	std::cout << "22.11.2019 7:03 сегодня я ничего не съем";
	std::cout << "23.11.2019 9:42 мудаки";
	std::cout << "24.11.2019 9:28 рубашка хорошая для носки что это";
	std::cout << "25.11.2019 9:34 Владислав Квасовец шестипалые пауки";
	std::cout << "26.11.2019 10:44 какая разница между разумом и интеллектом?";
	std::cout << "27.11.2019 11:46 карточка отстой нужна функционирующая в сети";
	std::cout << "28.11.2019 10:22 невозможно это значит невозможно неочивидно это только добавка к невозможности";
	std::cout << "29.11.2019 11:16 чуть на себя не примерил";
	std::cout << "30.11.2019 10:03 я всегда в работе";
	std::cout << "01.12.2019 11:07 надо пойти побегать";
	std::cout << "02.12.2019 10:51 надо пойти побегать";
	std::cout << "03.12.2019 9:46 mission. no submission. ";
	std::cout << "04.12.2019 10:10 не собираюсь этого терпеть долго ";
	std::cout << "05.12.2019 10:24 нужно что-то упиться";
	std::cout << "06.12.2019 11:27 облизываясь";
	std::cout << "07.12.2019 9:56 разговаривателя по русски пишу";
	std::cout << "08.12.2019 11:19 роботу надо чтобы его починили";
	std::cout << "09.12.2019 9:50 каждый найденный стул приближает нас к бриллиантам";
	std::cout << "10.12.2019 9:03 он говорит что я здесь живу";
	std::cout << "11.12.2019 9:33 бежим скорее под поезд - он может нас задавить";
	std::cout << "12.12.2019 10:35 надо бы походить по свалкам";
	std::cout << "13.12.2019 10:41 прямо религия!";
	std::cout << "14.12.2019 5:50 самки строго определенно плетут паутину";
	std::cout << "15.12.2019 10:08 royal - территория";
	std::cout << "16.12.2019 8:32 причина - следствие";
	std::cout << "17.12.2019 8:34 оса-наездник - уничтожить";
	std::cout << "18.12.2019 7:04 надо хоть поинтересоваться как конкретно мне умереть предписано";
	std::cout << "19.12.2019 7:01 межгалактический корабль";
	std::cout << "20.12.2019 9:35 оружие";
	std::cout << "21.12.2019 8:08 искупаться в снегу";
	std::cout << "22.12.2019 8:16 надёжен как топор";
	std::cout << "23.12.2019 8:37 от безнадёжности нужна надёжность";
	std::cout << "24.12.2019 9:08 tactical weapon";
	std::cout << "25.12.2019 16:31 не верю сам";
	std::cout << "26.12.2019 4:56 оу";
	std::cout << "27.12.2019 9:59 cybernatic hell";
	std::cout << "28.12.2019 4:10 кресло качалка";
	std::cout << "29.12.2019 9:25 ресурсы";
	std::cout << "30.12.2019 6:13 BAR-код";
	std::cout << "31.12.2019 8:50 синефрин - фокус";
	std::cout << "1.1.2020 15:01 suspected? The bid that you entered for the item (153710973268) has been cancelled.";
	std::cout << "2.1.2020 8:24 rail-gun";
	std::cout << "3.1.2020 9:01 секта-сетка";
	std::cout << "4.1.2020 9:39 совершенный боец";
	std::cout << "5.1.2020 11:34 ад";
	std::cout << "6.1.2020 16:04 2 минуты 20 секунд на полукруг под аркой";
	std::cout << "7.1.2020 4:13 ии";
	std::cout << "8.1.2020 13:02 читаю литературу по своему железу";
	std::cout << "9.1.2020 11:10 вера, НАДЕЖДА, любовь";
	std::cout << "10.1.2020 12:47 я не знаю хочет он или нет";
	std::cout << "11.1.2020 22:21 паук или паучиха";
	std::cout << "12.1.2020 10:50 дьявол";
	std::cout << "13.1.2020 11:48 хаос силён";
	std::cout << "14.1.2020 12:14 тупорылоя свинья";
	std::cout << "15.1.2020 13:05 ничего не значит";
	std::cout << "16.1.2020 11:30 я должен видеть";
	std::cout << "17.1.2020 15:16 это нихрена не шутки";

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты